app/controllers/arquivos_controller.rb

INSERT INTO "arquivos" ("arquivo_file_size", "arquivo_content_type", "updated_at", "chamado_id", "created_at", "arquivo_file_name") VALUES(1741, E'image/png', '2012-03-12 16:20:01.104334', 5, '2012-03-12 16:20:01.104334', E'task-complete.png') RETURNING "id"
---
   def create
      @arquivo = Arquivo.new(params[:arquivo])

      respond_to do |format|
         if @arquivo.save