app/controllers/chamados_controller.rb

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)
---
  def get_tipo_chamado
     if !params[:id].blank? and params[:id].to_i > 0
        @tipo_chamados = Sistema.find(params[:id]).tipo_chamados

SELECT * FROM "chamados" WHERE (status = 0 and sistema_id in (1,2)) ORDER BY updated_at desc LIMIT 30 OFFSET 0
SELECT * FROM "sistemas" INNER JOIN "grupos_sistemas" ON "sistemas".id = "grupos_sistemas".sistema_id WHERE ("grupos_sistemas".grupo_id = 6 )
---
  def abertos
     @chamados = Chamado.paginate(:conditions => ["status = ? and sistema_id in (?)", 0, @current_usuario.sistemas_atendimento.collect{|s| s.id }],
                                  :order => 'updated_at desc', :page => params[:page] )

SELECT * FROM "chamados" WHERE (status <> 0 and status <> 4 ) ORDER BY updated_at desc LIMIT 30 OFFSET 0
---
  def em_atendimento
     @chamados = Chamado.paginate(:conditions => ["status not in (?,?) and sistema_id in (?)", 0, 4, @current_usuario.sistemas_atendimento.collect{|s| s.id }], :order => 'updated_at desc', :page => params[:page] )

SELECT * FROM "chamados" WHERE (status <> 4 and atendente_id = 4) ORDER BY updated_at desc LIMIT 30 OFFSET 0
---
  def meus_pendentes
     @chamados = Chamado.paginate(:conditions => ["status <> ? and atendente_id =  ?", 4, @current_usuario.id],
                                  :order => 'updated_at desc', :page => params[:page] )

SELECT * FROM "chamados" WHERE (status <> 4 and grupo_id in (6,2)) ORDER BY updated_at desc LIMIT 30 OFFSET 0
SELECT * FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos_usuarios".usuario_id = 4 )
---
  def grupo_pendentes
     @chamados = Chamado.paginate(:conditions => ["status <> ? and grupo_id in (?)", 4, @current_usuario.grupos.collect{|g| g.id }],
                                  :order => 'updated_at desc',:page => params[:page])

SELECT * FROM "chamados" WHERE ("chamados"."id" = 10)
SELECT "grupos".* FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE (atendente is true) AND ("grupos_usuarios".usuario_id = 3 )
SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)
UPDATE "chamados" SET "atendente_id" = 3, "grupo_id" = 7, "updated_at" = '2012-03-13 14:01:59.905007' WHERE "id" = 29
---
  def atender
     chamado = Chamado.find(params[:id])
     chamado.atendente = @current_usuario
     @current_usuario.grupos.all(:conditions => "atendente is true").each do |g|
        if chamado.sistema.grupos_atendimento.include? g
           chamado.grupo = g
           chamado.save

SELECT * FROM "chamados" WHERE ("chamados"."id" = 10)
SELECT "grupos".id FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos"."id" = 1) AND ("grupos_usuarios".usuario_id = 1 ) LIMIT 1
SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)
SELECT * FROM "usuarios" INNER JOIN "grupos_usuarios" ON "usuarios".id = "grupos_usuarios".usuario_id WHERE ("grupos_usuarios".grupo_id = 1 )
---
  def encaminhar
     @chamado    = Chamado.find(params[:id])
     @grupos     = @chamado.sistema.grupos_atendimento.collect { |g| [g.nome, g.id] }
     @atendentes = []
     @chamado.grupo.usuarios.each do |u|

SELECT * FROM "chamados" WHERE (usuario_id = 1) ORDER BY updated_at desc LIMIT 30 OFFSET 0
---
  def meus_chamados
    @chamados = Chamado.paginate(:conditions => ["usuario_id = ?", @current_usuario.id], :order => 'updated_at desc', :page => params[:page] )

SELECT * FROM "chamados" ORDER BY id desc LIMIT 30 OFFSET 0
---
  def index
    @chamados = Chamado.paginate(:order => 'id desc', :page => params[:page] )

SELECT * FROM "tipo_chamados" WHERE ("tipo_chamados"."id" = 2)
---
  def show
    @chamado = Chamado.find(params[:id])

INSERT INTO "chamados" ("tipo_chamado_id", "grupo_id", "status", "created_at", "usuario_id", "atendente_id", "updated_at", "sistema_id") VALUES(1, NULL, 0, '2012-03-13 14:01:34.510702', 5, NULL, '2012-03-13 14:01:34.510702', 1) RETURNING "id"
INSERT INTO "arquivos" ("arquivo_file_name", "arquivo_file_size", "created_at", "chamado_id", "updated_at", "arquivo_content_type") VALUES(E'DSC02770.JPG', 2039402, '2012-03-13 17:23:21.042499', 30, '2012-03-13 17:23:21.042499', E'image/jpeg') RETURNING "id"
INSERT INTO "mensagems" ("descricao", "chamado_status", "created_at", "usuario_id", "chamado_id", "updated_at") VALUES(E'teste_envio', NULL, '2012-03-13 11:52:04.512874', NULL, 12, '2012-03-13 11:52:04.512874') RETURNING "id"
UPDATE "chamados" SET "status" = NULL, "updated_at" = '2012-03-13 11:50:44.286871' WHERE "id" = 11
UPDATE "mensagems" SET "chamado_status" = 0, "updated_at" = '2012-03-13 12:05:54.132024', "chamado_id" = 27, "descricao" = E'dasdada 2222', "created_at" = '2012-03-13 12:05:54.120686' WHERE "id" = 21
---
  def create
     @chamado = Chamado.new(params[:chamado])
     @chamado.usuario  = @current_usuario

     salvo = @chamado.save

     if salvo and !params[:arquivo].blank?
        arquivo         = Arquivo.new
        arquivo.arquivo = params[:arquivo]
        arquivo.chamado = @chamado
        arquivo.save
     end

     @mensagem.chamado   = @chamado
     @mensagem.descricao = params[:mensagem]
     @mensagem.save

SELECT * FROM "chamados" WHERE ("chamados"."id" = 10)
UPDATE "chamados" SET "tipo_chamado_id" = 2, "updated_at" = '2012-03-12 18:04:32.519868', "sistema_id" = 1 WHERE "id" = 10
---
  def update
    @chamado = Chamado.find(params[:id])

    respond_to do |format|
      if @chamado.update_attributes(params[:chamado])