app/controllers/grupos_controller.rb

SELECT * FROM "grupos" ORDER BY nome LIMIT 30 OFFSET 0
---
   def index
      @grupos = Grupo.paginate(:order => 'nome', :page => params[:page] )

SELECT * FROM "grupos" WHERE ("grupos"."id" = 1)
SELECT * FROM "usuarios" ORDER BY name
---
   def usuarios
      @grupo = Grupo.find(params[:id])
      @usuarios = Usuario.all(:order => 'name')

SELECT * FROM "grupos" WHERE ("grupos"."id" = 1)
SELECT * FROM "sistemas" ORDER BY nome
---
   def sistemas
      @grupo = Grupo.find(params[:id])
      @sistemas = Sistema.all(:order => 'nome')

SELECT * FROM "grupos" WHERE ("grupos"."id" = 2)
SELECT * FROM "grupos" LIMIT 1
SELECT * FROM "sistemas" INNER JOIN "grupos_sistemas" ON "sistemas".id = "grupos_sistemas".sistema_id WHERE ("grupos_sistemas".grupo_id = 2 )
SELECT "grupos".id FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos"."id" = 1) AND ("grupos_usuarios".usuario_id = 1 ) LIMIT 1
---
   def update_sistema
      @grupo = Grupo.find(params[:id])

      if params[:tipo].blank?
         @grupo.sistemas.delete_all
      else
         vet_ids = []
         params[:tipo].each do |t|
            vet_ids << t.to_i
         end

         @grupo.sistemas.each do |s|
            unless vet_ids.include? s.id
               @grupo.sistemas.delete(s)
               vet_ids.delete(s.id)
            end
         end

         vet_ids.each do |id|
            sistema = Sistema.find(id)
            @grupo.sistemas << sistema unless @grupo.sistemas.include? sistema

SELECT * FROM "grupos" WHERE ("grupos"."id" = 1)
SELECT * FROM "grupos" LIMIT 1
SELECT * FROM "usuarios" INNER JOIN "grupos_usuarios" ON "usuarios".id = "grupos_usuarios".usuario_id WHERE ("grupos_usuarios".grupo_id = 1 )
SELECT "grupos".id FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos"."id" = 1) AND ("grupos_usuarios".usuario_id = 2 ) LIMIT 1
---
   def update_usuario
      @grupo = Grupo.find(params[:id])

      if params[:tipo].blank?
         @grupo.usuarios.delete_all
      else
         vet_ids = []
         params[:tipo].each do |t|
            vet_ids << t.to_i
         end


         @grupo.usuarios.each do |u|
            unless vet_ids.include? u.id
               @grupo.usuarios.delete(u)
               vet_ids.delete(u.id)
            end
         end

         vet_ids.each do |id|
            usuario = Usuario.find(id)
            @grupo.usuarios << usuario unless @grupo.usuarios.include? usuario

SELECT * FROM "grupos" WHERE ("grupos"."id" = 2)
---
   def show
      @grupo = Grupo.find(params[:id])

SELECT * FROM "grupos" WHERE ("grupos"."id" = 1)
---
   def edit
      @grupo = Grupo.find(params[:id])

INSERT INTO "grupos" ("nome", "master", "atendente", "created_at", "updated_at") VALUES(E'Atendentes Sistema UA', NULL, 't', '2012-03-13 11:11:33.194133', '2012-03-13 11:11:33.194133') RETURNING "id"
---
   def create
      @grupo = Grupo.new(params[:grupo])

      respond_to do |format|
         if @grupo.save

SELECT * FROM "grupos" WHERE ("grupos"."id" = 2)
UPDATE "grupos" SET "updated_at" = '2012-03-13 11:02:51.642103', "nome" = E'Atendentes Suporte', "atendente" = 't' WHERE "id" = 3
---
   def update
      @grupo = Grupo.find(params[:id])

      respond_to do |format|
         if @grupo.update_attributes(params[:grupo])