app/controllers/mensagems_controller.rb

   def create
      @mensagem = Mensagem.new(params[:mensagem])
      @mensagem.usuario = @current_usuario

      respond_to do |format|
         if @mensagem.save
---
INSERT INTO "mensagems" ("descricao", "chamado_status", "created_at", "usuario_id", "chamado_id", "updated_at") VALUES(E'huhauahuhauahuaa.....', 2, '2012-03-13 17:25:16.664742', 3, 30, '2012-03-13 17:25:16.664742') RETURNING "id"

   def index
      @mensagems = Mensagem.all
---
SELECT * FROM "mensagems"

   def show
      @mensagem = Mensagem.find(params[:id])
---
SELECT * FROM "mensagems" WHERE ("mensagems"."id" = 3)