app/controllers/sistemas_controller.rb

SELECT * FROM "sistemas" ORDER BY nome LIMIT 30 OFFSET 0
---
   def index
      @sistemas = Sistema.paginate(:order => 'nome', :page => params[:page] )

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 0)
---
   def show
      @sistema = Sistema.find(params[:id])

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 2)
---
   def edit
      @sistema = Sistema.find(params[:id])

INSERT INTO "sistemas" ("nome", "created_at", "ativo", "updated_at") VALUES(E'Último Ataque', '2012-03-13 11:11:03.009653', 't', '2012-03-13 11:11:03.009653') RETURNING "id"
---
   def create
      @sistema = Sistema.new(params[:sistema])

      respond_to do |format|
         if @sistema.save

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 2)
UPDATE "sistemas" SET "updated_at" = '2012-03-08 20:06:52.230440', "ativo" = 't' WHERE "id" = 2
---
   def update
     @sistema = Sistema.find(params[:id])

     respond_to do |format|
       if @sistema.update_attributes(params[:sistema])

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)
SELECT * FROM "tipo_chamados" ORDER BY nome
---
   def tipo_de_chamado
      @sistema = Sistema.find(params[:id])
      @tipo_chamado = TipoChamado.all(:order => 'nome')

SELECT * FROM "sistemas" WHERE ("sistemas"."id" = 1)
SELECT * FROM "tipo_chamados" WHERE ("tipo_chamados"."id" = 2)
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2) LIMIT 1
DELETE FROM "sistemas_tipo_chamados" WHERE sistema_id = 1 AND tipo_chamado_id IN (1)
INSERT INTO "sistemas_tipo_chamados" ("id", "created_at", "updated_at", "sistema_id", "tipo_chamado_id") VALUES (2, '2012-03-08 19:57:36.877627', '2012-03-08 19:57:36.877627', 1, 2) RETURNING "id"
SELECT * FROM "tipo_chamados" INNER JOIN "sistemas_tipo_chamados" ON "tipo_chamados".id = "sistemas_tipo_chamados".tipo_chamado_id WHERE ("sistemas_tipo_chamados".sistema_id = 1 )
---
   def update_tipo_de_chamado
      @sistema = Sistema.find(params[:id])

      if params[:tipo].blank?
         @sistema.usuarios.delete_all
      else
         vet_ids = []
         params[:tipo].each do |t|
            vet_ids << t.to_i
         end

         @sistema.tipo_chamados.each do |u|
            unless vet_ids.include? u.id
               @sistema.tipo_chamados.delete(u)
               vet_ids.delete(u.id)
            end
         end

         vet_ids.each do |id|
            tipo = TipoChamado.find(id)
            @sistema.tipo_chamados << tipo unless @sistema.tipo_chamados.include? tipo