app/controllers/tipo_chamados_controller.rb

SELECT * FROM "tipo_chamados" ORDER BY nome LIMIT 30 OFFSET 0
---
   def index
      @tipo_chamados = TipoChamado.paginate(:order => 'nome', :page => params[:page] )

SELECT * FROM "tipo_chamados" WHERE ("tipo_chamados"."id" = 1)
---
   def show
      @tipo_chamado = TipoChamado.find(params[:id])

SELECT * FROM "tipo_chamados" WHERE ("tipo_chamados"."id" = 1)
---
   def edit
      @tipo_chamado = TipoChamado.find(params[:id])

INSERT INTO "tipo_chamados" ("updated_at", "nome", "created_at") VALUES('2012-03-09 16:29:34.880259', E'Suporte', '2012-03-09 16:29:34.880259') RETURNING "id"
---
   def create
       @tipo_chamado = TipoChamado.new(params[:tipo_chamado])

       respond_to do |format|
          if @tipo_chamado.save

SELECT * FROM "tipo_chamados" WHERE ("tipo_chamados"."id" = 1)
---
   def update
       @tipo_chamado = TipoChamado.find(params[:id])