app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios" ORDER BY login LIMIT 30 OFFSET 0
---
   def index
      @usuarios = Usuario.paginate(:order => 'login', :page => params[:page] )

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1) LIMIT 1
UPDATE "usuarios" SET "crypted_password" = E'6b396bab5158f5fce5a670d13eef2b9e7ad95b72', "updated_at" = '2012-03-09 16:41:22.068674' WHERE "id" = 2
---
   def reset
      usuario = Usuario.find(params[:id])
      usuario.password = usuario.password_confirmation = '123456'
      usuario.save

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2) LIMIT 1
UPDATE "usuarios" SET "updated_at" = '2012-03-09 16:34:19.402430', "bloqueado" = 't' WHERE "id" = 2
---
   def bloquear
      usuario = Usuario.find(params[:id])
      usuario.bloqueado = (usuario.bloqueado == false)
      usuario.save

SELECT * FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos_usuarios".usuario_id = 2 )
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2) LIMIT 1
---
   def edit
      login_required
      if @current_usuario.grupos.include? Grupo.first
         id = params[:id]
      else
         id = @current_usuario.id
      end

      @usuario = Usuario.find(id)

SELECT * FROM "grupos" INNER JOIN "grupos_usuarios" ON "grupos".id = "grupos_usuarios".grupo_id WHERE ("grupos_usuarios".usuario_id = 2 )
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2) LIMIT 1
UPDATE "usuarios" SET "email" = E'suporte@aliena.com.br', "telefone" = E'(85) 3261-2671', "updated_at" = '2012-03-13 18:43:50.328897' WHERE "id" = 5
---
   def update
     login_required
     if @current_usuario.grupos.include? Grupo.first
         id = params[:id]
      else
         id = @current_usuario.id
      end
      @usuario = Usuario.find(id)

      respond_to do |format|
         if @usuario.update_attributes(params[:usuario])

INSERT INTO "usuarios" ("salt", "login", "bloqueado", "telefone", "remember_token_expires_at", "name", "remember_token", "email", "crypted_password", "updated_at", "created_at") VALUES(E'66e945681c9eccae4f5b636a7e14b1c3da968edb', E'djosino', 'f', E'(85) 3231-2802', NULL, E'Danilo Josino', NULL, E'danilo.josino@gmail.com', E'43a37ac34214aa6ade985fb09a296d129b5c8dba', '2012-03-09 16:05:25.260201', '2012-03-09 16:05:25.260201') RETURNING "id"
---
   def create
      #logout_keeping_session!
      @usuario = Usuario.new(params[:usuario])
      success = @usuario && @usuario.save